cv/cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-19 Fri 11:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Martin Indra</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Martin Indra" />
</head>
<body>
<div id="content">
<h1 class="title">Martin Indra</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org70a5d88">1. Personal Info</a></li>
<li><a href="#orgae991a7">2. Objective</a></li>
<li><a href="#orgef3c485">3. Education</a>
<ul>
<li><a href="#orgd8dedd7">3.1. Faculty of Electrical Engineering, Czech Technical University in Prague</a></li>
<li><a href="#org39ac044">3.2. Faculty of Electrical Engineering, Czech Technical University in Prague</a></li>
</ul>
</li>
<li><a href="#org342627e">4. Professional Experience</a>
<ul>
<li><a href="#org1b63ec1">4.1. Datamole</a></li>
<li><a href="#orgda97910">4.2. SpaceKnow</a></li>
<li><a href="#org6e3d815">4.3. Nangu TV</a></li>
<li><a href="#org47b016c">4.4. Hewlett-Packard</a></li>
</ul>
</li>
<li><a href="#org60873df">5. Skills</a></li>
</ul>
</div>
</div>

<div id="outline-container-org70a5d88" class="outline-2">
<h2 id="org70a5d88"><span class="section-number-2">1</span> Personal Info</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Name: Martin Indra</li>
<li>Year of Birth: 1992</li>
<li>Nationality: Czech</li>
<li>Location: Prague, Czech Republic</li>
<li>E-mail Address: martin.indra at mgn dot cz</li>
</ul>
</div>
</div>

<div id="outline-container-orgae991a7" class="outline-2">
<h2 id="orgae991a7"><span class="section-number-2">2</span> Objective</h2>
<div class="outline-text-2" id="text-2">
<p>
Software engineering role focusing on cross-disciplinary problems, including
cloud computing, machine learning, statistical data analysis and
bioinformatics.
</p>
</div>
</div>

<div id="outline-container-orgef3c485" class="outline-2">
<h2 id="orgef3c485"><span class="section-number-2">3</span> Education</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd8dedd7" class="outline-3">
<h3 id="orgd8dedd7"><span class="section-number-3">3.1</span> Faculty of Electrical Engineering, Czech Technical University in Prague</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Finished with Master's degree in Bioinformatics</li>
<li>Finished: 01/2021</li>
<li>Diploma Thesis: <a href="https://mgn.cz/introns.pdf">Automatic Intron Detection in Metagenomes Using Neural Networks</a></li>
</ul>
</div>
</div>

<div id="outline-container-org39ac044" class="outline-3">
<h3 id="org39ac044"><span class="section-number-3">3.2</span> Faculty of Electrical Engineering, Czech Technical University in Prague</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Finished with Bachelor's degree in Software Systems</li>
<li>Finished: 01/2015</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org342627e" class="outline-2">
<h2 id="org342627e"><span class="section-number-2">4</span> Professional Experience</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1b63ec1" class="outline-3">
<h3 id="org1b63ec1"><span class="section-number-3">4.1</span> Datamole</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>02/2019 &#x2013; now</li>
<li>Contributions &amp; Responsibilities:
<ul class="org-ul">
<li>Team Leader of Machine Learning Engineering Team</li>
<li>Software Architect</li>
</ul></li>
<li>Web: <a href="https://www.datamole.ai/">https://www.datamole.ai/</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgda97910" class="outline-3">
<h3 id="orgda97910"><span class="section-number-3">4.2</span> SpaceKnow</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>10/2014 &#x2013; 02/2019</li>
<li>Contributions &amp; Responsibilities:
<ul class="org-ul">
<li>Overall platform architecture and <a href="https://docs.spaceknow.com/">REST API</a> design and documentation.</li>
<li>Leading and on-boarding other developers.</li>
<li>Code review, pair programming, test automation, DevOps.</li>
<li>Python, Google Cloud Platform, Redis, NoSQL, Kubernetes, …</li>
<li>Fully automated, on-demand processing of millions of mega-pixels of optical
and radar data on thousands of CPU cores with advanced CV algorithms
including deep neural networks.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6e3d815" class="outline-3">
<h3 id="org6e3d815"><span class="section-number-3">4.3</span> Nangu TV</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>06/2012 &#x2013; 11//2014</li>
<li>Contributions &amp; Responsibilities:
<ul class="org-ul">
<li>Analysis and implementation of IPTV set-top boxes front-end using
JavaScript.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org47b016c" class="outline-3">
<h3 id="org47b016c"><span class="section-number-3">4.4</span> Hewlett-Packard</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Parts of 2010 and 2011</li>
<li>Part-time job during high school summer breaks</li>
<li>Development of cloud software for companies using J2EE and HTML5.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org60873df" class="outline-2">
<h2 id="org60873df"><span class="section-number-2">5</span> Skills</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Languages: Czech (Native), English (C2 CEFR), Italian (B1 CEFR)</li>
<li>Programming: Python, Rust, C#, TypeScript, …</li>
<li>Cloud:
<ul class="org-ul">
<li>Google Cloud Platform (very good)</li>
<li>Microsoft Azure (very good)</li>
<li>Amazon Web Services (limited experience)</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Martin Indra</p>
<p class="date">Created: 2021-03-19 Fri 11:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
